# Урок 1. Контрольная работа

Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.


## Текстовое описание решения:


**1) Ввод данных:**
Console.Write("Введите набор символов через знак (,): "); выводит приглашение пользователю ввести набор символов через запятую.
string inStringSimvol = Console.ReadLine(); считывает введенную строку с консоли и сохраняет её в переменной inStringSimvol.

**2) Формирование массива:**
string[] arraySimvol = GetArrayStringConsole(inStringSimvol); вызывает функцию GetArrayStringConsole, которая разделяет введенную строку inStringSimvol по запятой (,) и возвращает массив строк. Этот массив сохраняется в переменной arraySimvol.

**3) Вывод введенных символов:**
Console.WriteLine("Введенные символы: "); выводит сообщение о том, что следует ниже - введенные символы.
Print(arraySimvol); вызывает функцию Print, которая выводит на консоль элементы массива arraySimvol, разделенные запятой.

**4) Фильтрация и вывод отфильтрованных символов:**
Console.WriteLine("Введенные символы длиной меньше либо равны 3: "); выводит сообщение о том, что следует ниже - отфильтрованные символы.
Print(GetArrayThreeSimvol(arraySimvol)); вызывает функцию GetArrayThreeSimvol, которая фильтрует строки из arraySimvol, оставляя только те, длина которых меньше или равна 3 символам. Результат выводится с использованием функции Print.

**5) Завершение программы:**
Console.WriteLine(); выводит пустую строку для визуального разделения вывода.